[Armure_de_givre.A_armure_givre_Buff H7BaseBuff]
mName="Ледяная броня"
mTooltip="Существо получает %stat1 %icon_defense и с вероятностью 50% замораживает врагов, которые атакуют его в ближнем бою. Длительность (ходов): %durnow."

[Armure_de_givre.A_BurningDetermination H7HeroAbility]
mTooltipMagicGuild="Увеличивает защиту выбранного союзника и с вероятностью 50% замораживает всех врагов, которые атакуют его в ближнем бою."
mTooltipMagicGuildRankLine=""
mTooltipUpgraded="Увеличивает защиту выбранных союзников в области 4x4 на  %buff1.buff.stat1 %icon_defense и с вероятностью 50% замораживает всех врагов, которые атакуют их в ближнем бою в течение %buff1.buff.durini ходов."
mName="Ледяная броня"
mTooltip="Увеличивает защиту выбранного союзника на %buff1.buff.stat1 и с вероятностью 50% замораживает всех врагов, которые атакуют его в ближнем бою в течение %buff1.buff.durini ходов."